Revit 2026 API

# SelectionSetReferences Method

---
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetReferences(
	IList<Reference> references
)
```
```vb
Public Sub SetReferences (
	references As IList(Of Reference)
)
```
```cpp
public:
void SetReferences(
	IList<Reference^>^ references
)
```
```fsharp
member SetReferences :
        references : IList<Reference> -> unit
```

#### Parameters

references IListReference

#### Reference

Selection Class

Autodesk.Revit.UI.Selection Namespace